PWBell_H2_200psi_10Paenv_20mmLd/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:   2.3.0  //4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    gasjet
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }
	
	back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
	
    // open
    // {
    //     type            zeroGradient;
    // }
}


// ************************************************************************* //